sahasradal/ch32v203_/ch32v203.inc
.equ SRAM_start, 0x20000000
.equ SRAM_end,  0x20000800
.equ STACK, 0x20000800 

.equ R32_PWR_CTLR ,0x40007000 
.equ R32_PWR_CSR ,0x40007004 
.equ R32_RCC_CTLR ,0x40021000 
.equ R32_RCC_CFGR0,0x40021004 
.equ R32_RCC_INTR ,0x40021008 
.equ R32_RCC_APB2PRSTR ,0x4002100C 
.equ .equ R32_RCC_APB1PRSTR ,0x40021010 
.equ R32_RCC_AHBPCENR ,0x40021014  
.equ R32_RCC_APB2PCENR ,0x40021018  
.equ R32_RCC_APB1PCENR ,0x4002101C  
.equ R32_RCC_BDCTLR ,0x40021020  
.equ R32_RCC_RSTSCKR ,0x40021024  
.equ R32_RCC_AHBRSTR ,0x40021028  
.equ R32_RCC_CFGR2 ,0x4002102C 
.equ R32_HSE_CAL_CTRL ,0x4002202C 
.equ R16_LSI32K_TUNE ,0x40022036  
.equ R8_LSI32K_CAL_CFG ,0x40022049  
.equ R16_LSI32K_CAL_STATR ,0x4002204C  
.equ R8_LSI32K_CAL_OV_CNT, 0x4002204E 
.equ R8_LSI32K_CAL_CTRL,0x4002204F 
.equ R16_BKP_DATAR1, 0x40006C04  
.equ R16_BKP_DATAR2, 0x40006C08  
.equ R16_BKP_DATAR3, 0x40006C0C 
.equ R16_BKP_DATAR4, 0x40006C10  
.equ R16_BKP_DATAR5, 0x40006C14 
.equ R16_BKP_DATAR6, 0x40006C18 
.equ R16_BKP_DATAR7, 0x40006C1C  
.equ R16_BKP_DATAR8, 0x40006C20 
.equ R16_BKP_DATAR9, 0x40006C24  
.equ R16_BKP_DATAR10, 0x40006C28 
.equ R16_BKP_OCTLR, 0x40006C2C 
.equ R16_BKP_TPCTLR, 0x40006C30  
.equ R16_BKP_TPCSR, 0x40006C34  
.equ R16_BKP_DATAR11, 0x40006C40  
.equ R16_BKP_DATAR12, 0x40006C44 
.equ R16_BKP_DATAR13, 0x40006C48  
.equ R16_BKP_DATAR14, 0x40006C4C  
.equ R16_BKP_DATAR15, 0x40006C50  
.equ R16_BKP_DATAR16, 0x40006C54  
.equ R16_BKP_DATAR17, 0x40006C58  
.equ R16_BKP_DATAR18, 0x40006C5C  
.equ R16_BKP_DATAR19, 0x40006C60  
.equ R16_BKP_DATAR20, 0x40006C64  
.equ R16_BKP_DATAR21, 0x40006C68  
.equ R16_BKP_DATAR22, 0x40006C6C  
.equ R16_BKP_DATAR23, 0x40006C70  
.equ R16_BKP_DATAR24, 0x40006C74  
.equ R16_BKP_DATAR25, 0x40006C78  
.equ R16_BKP_DATAR26, 0x40006C7C  
.equ R16_BKP_DATAR27, 0x40006C80  
.equ R16_BKP_DATAR28, 0x40006C84  
.equ R16_BKP_DATAR29, 0x40006C88  
.equ R16_BKP_DATAR30, 0x40006C8C  
.equ R16_BKP_DATAR31, 0x40006C90  
.equ R16_BKP_DATAR32, 0x40006C94  
.equ R16_BKP_DATAR33, 0x40006C98  
.equ R16_BKP_DATAR34, 0x40006C9C  
.equ R16_BKP_DATAR35, 0x40006CA0  
.equ R16_BKP_DATAR36, 0x40006CA4  
.equ R16_BKP_DATAR37, 0x40006CA8  
.equ R16_BKP_DATAR38, 0x40006CAC  
.equ R16_BKP_DATAR39, 0x40006CB0  
.equ R16_BKP_DATAR40, 0x40006CB4  
.equ R16_BKP_DATAR41, 0x40006CB8  
.equ R16_BKP_DATAR42, 0x40006CBC 
.equ R16_RTC_CTLRH,0x40002800 
.equ R16_RTC_CTLRL ,0x40002804 
.equ R16_RTC_PSCRH ,0x40002808 
.equ .equ R16_RTC_PSCRL ,0x4000280C 
.equ R16_RTC_DIVH,0x40002810 
.equ R16_RTC_DIVL,0x40002814 
.equ R16_RTC_CNTH,0x40002818 
.equ R16_RTC_CNTL ,0x4000281C 
.equ R16_RTC_ALRMH ,0x40002820 
.equ R16_RTC_ALRML,0x40002824 
.equ R16_IWDG_CTLR ,0x40003000 
.equ R16_IWDG_PSCR,0x40003004 
.equ R16_IWDG_RLDR,0x40003008 
.equ R16_IWDG_STATR,0x4000300C 
.equ R16_WWDG_CTLR, 0x40002C00  
.equ R16_WWDG_CFGR, 0x40002C04  
.equ R16_WWDG_STATR, 0x40002C08 
.equ R32_EXTI_INTENR, 0x40010400  
.equ R32_EXTI_EVENR, 0x40010404  
.equ R32_EXTI_RTENR, 0x40010408  
.equ R32_EXTI_FTENR, 0x4001040C  
.equ R32_EXTI_SWIEVR, 0x40010410 
.equ R32_EXTI_INTFR, 0x40010414 
.equ R32_PFIC_ISR1, 0xE000E000  
.equ R32_PFIC_ISR2, 0xE000E004  
.equ R32_PFIC_ISR3, 0xE000E008  
.equ R32_PFIC_ISR4, 0xE000E00C  
.equ R32_PFIC_IPR1, 0xE000E020  
.equ R32_PFIC_IPR2, 0xE000E024 
.equ R32_PFIC_IPR3, 0xE000E028 
.equ R32_PFIC_IPR4, 0xE000E02C 
.equ R32_PFIC_ITHRESDR, 0xE000E040 
.equ R32_PFIC_CFGR, 0xE000E048  
.equ R32_PFIC_GISR, 0xE000E04C  
.equ R32_PFIC_VTFIDR, 0xE000E050 
.equ R32_PFIC_VTFADDRR0, 0xE000E060 
.equ R32_PFIC_VTFADDRR1, 0xE000E064 
.equ R32_PFIC_VTFADDRR2, 0xE000E068 
.equ R32_PFIC_VTFADDRR3, 0xE000E06C 
.equ R32_PFIC_IENR1, 0xE000E100  
.equ R32_PFIC_IENR2, 0xE000E104  
.equ R32_PFIC_IENR3, 0xE000E108  
.equ R32_PFIC_IENR4, 0xE000E10C  
.equ R32_PFIC_IRER1, 0xE000E180  
.equ R32_PFIC_IRER2, 0xE000E184  
.equ R32_PFIC_IRER3, 0xE000E188  
.equ R32_PFIC_IRER4, 0xE000E18C  
.equ R32_PFIC_IPSR1, 0xE000E200  
.equ R32_PFIC_IPSR2, 0xE000E204  
.equ R32_PFIC_IPSR3, 0xE000E208  
.equ R32_PFIC_IPSR4, 0xE000E20C  
.equ R32_PFIC_IPRR1, 0xE000E280  
.equ R32_PFIC_IPRR2, 0xE000E284  
.equ R32_PFIC_IPRR3, 0xE000E288 
.equ R32_PFIC_IPRR4, 0xE000E28C 
.equ R32_PFIC_IACTR1, 0xE000E300  
.equ R32_PFIC_IACTR2, 0xE000E304  
.equ R32_PFIC_IACTR3, 0xE000E308  
.equ R32_PFIC_IACTR4, 0xE000E30C  
.equ R32_PFIC_IPRIOR, 0xE000E400 
.equ R32_PFIC_SCTLR, 0xE000ED10 
.equ R32_STK_CTLR, 0xE000F000  
.equ R32_STK_SR, 0xE000F004  
.equ R32_STK_CNTL, 0xE000F008 
.equ R32_STK_CNTH, 0xE000F00C 
.equ R32_STK_CMPLR, 0xE000F010 
.equ R32_STK_CMPHR, 0xE000F014 
.equ R32_GPIOA_CFGLR, 0x40010800  
.equ R32_GPIOB_CFGLR, 0x40010C00  
.equ R32_GPIOC_CFGLR, 0x40011000  
.equ R32_GPIOD_CFGLR, 0x40011400  
.equ R32_GPIOE_CFGLR, 0x40011800  
.equ R32_GPIOA_CFGHR, 0x40010804  
.equ R32_GPIOB_CFGHR, 0x40010C04 
.equ R32_GPIOC_CFGHR, 0x40011004  
.equ R32_GPIOD_CFGHR, 0x40011404  
.equ R32_GPIOE_CFGHR, 0x40011804  
.equ R32_GPIOA_INDR, 0x40010808  
.equ R32_GPIOB_INDR, 0x40010C08  
.equ R32_GPIOC_INDR, 0x40011008  
.equ R32_GPIOD_INDR, 0x40011408  
.equ R32_GPIOE_INDR, 0x40011808  
.equ R32_GPIOA_OUTDR, 0x4001080C 
.equ R32_GPIOB_OUTDR, 0x40010C0C 
.equ R32_GPIOC_OUTDR, 0x4001100C 
.equ R32_GPIOD_OUTDR, 0x4001140C 
.equ R32_GPIOE_OUTDR, 0x4001180C
.equ R32_GPIOA_BSHR, 0x40010810  
.equ R32_GPIOB_BSHR, 0x40010C10  
.equ R32_GPIOC_BSHR, 0x40011010  
.equ R32_GPIOD_BSHR, 0x40011410 
.equ R32_GPIOE_BSHR, 0x40011810  
.equ R32_GPIOA_BCR, 0x40010814  
.equ R32_GPIOB_BCR, 0x40010C14  
.equ R32_GPIOC_BCR, 0x40011014  
.equ R32_GPIOD_BCR, 0x40011414 
.equ R32_GPIOE_BCR, 0x40011814  
.equ R32_GPIOA_LCKR, 0x40010818 
.equ R32_GPIOB_LCKR, 0x40010C18 
.equ R32_GPIOC_LCKR, 0x40011018 
.equ R32_GPIOD_LCKR, 0x40011418 
.equ R32_GPIOE_LCKR, 0x40011818 
.equ R32_DMA1_INTFR ,0x40020000 
.equ R32_DMA1_INTFCR ,0x40020004 
.equ R32_DMA1_CFGR1,0x40020008 
.equ R32_DMA1_CNTR1 ,0x4002000C  
.equ R32_DMA1_PADDR1, 0x40020010  
.equ R32_DMA1_MADDR1 ,0x40020014
.equ R32_DMA1_CFGR2 ,0x4002001C
.equ R32_DMA1_CNTR2 ,0x40020020 
.equ R32_DMA1_PADDR2 ,0x40020024  
.equ R32_DMA1_MADDR2 ,0x40020028 
.equ R32_DMA1_CFGR3 ,0x40020030
.equ R32_DMA1_CNTR3 , 0x40020034  
.equ R32_DMA1_PADDR3,0x40020038 
.equ R32_DMA1_MADDR3 ,0x4002003C
.equ R32_DMA1_CFGR4 ,0x40020044
.equ R32_DMA1_CNTR4 ,0x40020048  
.equ R32_DMA1_PADDR4 ,0x4002004C 
.equ R32_DMA1_MADDR4 ,0x40020050
.equ R32_DMA1_CFGR5 ,0x40020058
.equ R32_DMA1_CNTR5 ,0x4002005C 
.equ R32_DMA1_PADDR5,0x40020060 
.equ R32_DMA1_MADDR5 ,0x40020064
.equ R32_DMA1_CFGR6 ,0x4002006C
.equ R32_DMA1_CNTR6 ,0x40020070  
.equ R32_DMA1_PADDR6,0x40020074  
.equ R32_DMA1_MADDR6 ,0x40020078
.equ R32_DMA1_CFGR7 ,0x40020080
.equ R32_DMA1_CNTR7,0x40020084 
.equ R32_DMA1_PADDR7,0x40020088 
.equ R32_DMA1_MADDR7,0x4002008C  
.equ R32_DMA1_CFGR8,0x40020094  
.equ R32_DMA1_CNTR8,0x40020098  
.equ R32_DMA1_PADDR8 ,0x4002009C 
.equ R32_DMA1_MADDR8 ,0x400200A0 
.equ R32_DMA2_INTFR,0x40020400
.equ R32_DMA2_INTFCR ,0x40020404  
.equ R32_DMA2_CFGR1,0x40020408  
.equ R32_DMA2_CNTR1 ,0x4002040C 
.equ R32_DMA2_PADDR1 ,0x40020410
.equ R32_DMA2_MADDR1 ,0x40020414
.equ R32_DMA2_CFGR2 ,0x4002041C
.equ R32_DMA2_CNTR2 ,0x40020420
.equ R32_DMA2_PADDR2 ,0x40020424
.equ R32_DMA2_MADDR2 ,0x40020428
.equ R32_DMA2_CFGR3 ,0x40020430
.equ R32_DMA2_CNTR3 ,0x40020434 
.equ R32_DMA2_PADDR3 ,0x40020438 
.equ R32_DMA2_MADDR3 ,0x4002043C
.equ R32_DMA2_CFGR4 ,0x40020444
.equ R32_DMA2_CNTR4 ,0x40020448
.equ R32_DMA2_PADDR4, 0x4002044C 
.equ R32_DMA2_MADDR4, 0x40020450 
.equ R32_DMA2_CFGR5, 0x40020458
.equ R32_DMA2_CNTR5, 0x4002045C
.equ R32_DMA2_PADDR5 ,0x40020460
.equ R32_DMA2_MADDR5 ,0x40020464
.equ R32_DMA2_CFGR6, 0x4002046C
.equ R32_DMA2_CNTR6, 0x40020470
.equ R32_DMA2_PADDR6, 0x40020474
.equ R32_DMA2_MADDR6, 0x40020478
.equ R32_DMA2_CFGR7, 0x40020480 
.equ R32_DMA2_CNTR7 ,0x40020484
.equ R32_DMA2_PADDR7, 0x40020488
.equ R32_DMA2_MADDR7, 0x4002048C 
.equ R32_DMA2_CFGR8, 0x40020490
.equ R32_DMA2_CNTR8, 0x40020494
.equ R32_DMA2_PADDR8, 0x40020498 
.equ R32_DMA2_MADDR8 ,0x4002049C
.equ R32_DMA2_CFGR9 ,0x400204A0
.equ R32_DMA2_CNTR9 ,0x400204A4
.equ R32_DMA2_PADDR9,0x400204A8 
.equ R32_DMA1_MADDR7,0x4002008C  
.equ R32_DMA1_CFGR8,0x40020094  
.equ R32_DMA1_CNTR8,0x40020098 
.equ R32_DMA1_PADDR8 ,0x4002009C
.equ R32_DMA1_MADDR8 ,0x400200A0  
.equ R32_DMA2_INTFR ,0x40020400  
.equ R32_DMA2_INTFCR ,0x40020404  
.equ R32_DMA2_CFGR1,0x40020408 
.equ R32_DMA2_CNTR1,0x4002040C 
.equ R32_DMA2_PADDR1 ,0x40020410
.equ R32_DMA2_MADDR1 ,0x40020414
.equ R32_DMA2_CFGR2,0x4002041C 
.equ R32_DMA2_CNTR2 ,0x40020420
.equ R32_DMA2_PADDR2 ,0x40020424
.equ R32_DMA2_MADDR2 ,0x40020428
.equ R32_DMA2_CFGR3,0x40020430  
.equ R32_DMA2_CNTR3 ,0x40020434
.equ R32_DMA2_PADDR3 ,0x40020438
.equ R32_DMA2_MADDR3 ,0x4002043C 
.equ R32_DMA2_CFGR4 ,0x40020444
.equ R32_DMA2_CNTR4 ,0x40020448
.equ R32_DMA2_PADDR4,0x4002044C 
.equ R32_DMA2_MADDR4 ,0x40020450
.equ R32_DMA2_CFGR5,0x40020458 
.equ R32_DMA2_CNTR5 ,0x4002045C
.equ R32_DMA2_PADDR5 ,0x40020460
.equ R32_DMA2_MADDR5 ,0x40020464
.equ R32_DMA2_CFGR6 ,0x4002046C
.equ R32_DMA2_CNTR6 ,0x40020470
.equ R32_DMA2_PADDR6 ,0x40020474 
.equ R32_DMA2_MADDR6 ,0x40020478
.equ R32_DMA2_CFGR7 ,0x40020480
.equ R32_DMA2_CNTR7 ,0x40020484
.equ R32_DMA2_PADDR7, 0x40020488
.equ R32_DMA2_MADDR7, 0x4002048C
.equ R32_DMA2_CFGR8 ,0x40020490
.equ R32_DMA2_CNTR8 ,0x40020494
.equ R32_DMA2_PADDR8, 0x40020498
.equ R32_DMA2_MADDR8 ,0x4002049C
.equ R32_DMA2_CFGR9 ,0x400204A0
.equ R32_DMA2_CNTR9 ,0x400204A8
.equ R32_DMA2_PADDR9 ,0x400204A8 
.equ R32_ADC1_STATR, 0x40012400  
.equ R32_ADC1_CTLR1, 0x40012404  
.equ R32_ADC1_CTLR2, 0x40012408  
.equ R32_ADC1_SAMPTR1, 0x4001240C  
.equ R32_ADC1_SAMPTR2, 0x40012410 
.equ R32_ADC1_IOFR1, 0x40012414  
.equ R32_ADC1_IOFR2, 0x40012418  
.equ R32_ADC1_IOFR3, 0x4001241C  
.equ R32_ADC1_IOFR4, 0x40012420  
.equ R32_ADC1_WDHTR, 0x40012424 
.equ R32_ADC1_WDLTR, 0x40012428  
.equ R32_ADC1_RSQR1, 0x4001242C  
.equ R32_ADC1_RSQR2, 0x40012430 
.equ R32_ADC1_RSQR3, 0x40012434 
.equ R32_ADC1_ISQR, 0x40012438  
.equ R32_ADC1_IDATAR1, 0x4001243C  
.equ R32_ADC1_IDATAR2, 0x40012440  
.equ R32_ADC1_IDATAR3, 0x40012444 
.equ R32_ADC1_IDATAR4, 0x40012448  
.equ R32_ADC1_RDATAR, 0x4001244C  
.equ R32_ADC2_STATR, 0x40012800 
.equ R32_ADC2_CTLR1, 0x40012804  
.equ R32_ADC2_CTLR2, 0x40012808  
.equ R32_ADC2_SAMPTR1, 0x4001280C 
.equ R32_ADC2_SAMPTR2, 0x40012810  
.equ R32_ADC2_IOFR1, 0x40012814  
.equ R32_ADC2_IOFR2, 0x40012818  
.equ R32_ADC2_IOFR3, 0x4001281C 
.equ R32_ADC2_IOFR4, 0x40012820 
.equ R32_ADC2_WDHTR, 0x40012824  
.equ R32_ADC2_WDLTR, 0x40012828 
.equ R32_ADC2_RSQR1, 0x4001282C  
.equ R32_ADC2_RSQR2, 0x40012830 
.equ R32_ADC2_RSQR3, 0x40012834  
.equ R32_ADC2_ISQR, 0x40012838  
.equ R32_ADC2_IDATAR1, 0x4001283C  
.equ R32_ADC2_IDATAR2, 0x40012840  
.equ R32_ADC2_IDATAR3, 0x40012844  
.equ R32_ADC2_IDATAR4, 0x40012848  
.equ R32_ADC2_RDATAR, 0x4001284C 
.equ R32_TKEY1_CHARGE1,0x4001240C 
.equ R32_TKEY1_CHARGE2 ,0x40012410 
.equ R32_TKEY1_CHGOFFSET, 0x4001243C 
.equ R32_TKEY1_ACT_DCG ,0x4001244C 
.equ R32_TKEY1_DR,0x4001244C 
.equ R32_TKEY2_CHARGE1,0x4001280C 
.equ R32_TKEY2_CHARGE2,0x40012810 
.equ R32_TKEY2_CHGOFFSET, 0x4001283C  
.equ R32_TKEY2_ACT_DCG,0x4001284C 
.equ R32_TKEY2_DR,0x4001284C 
.equ R16_TIM1_CTLR1, 0x40012C00 
.equ R16_TIM1_CTLR2, 0x40012C04  
.equ R16_TIM1_SMCFGR, 0x40012C08 
.equ R16_TIM1_DMAINTENR, 0x40012C0C  
.equ R16_TIM1_INTFR, 0x40012C10 
.equ R16_TIM1_SWEVGR, 0x40012C14  
.equ R16_TIM1_CHCTLR1, 0x40012C18 
.equ R16_TIM1_CHCTLR2, 0x40012C1C  
.equ R16_TIM1_CCER, 0x40012C20  
.equ R16_TIM1_CNT, 0x40012C24 
.equ R16_TIM1_PSC, 0x40012C28 
.equ R16_TIM1_ATRLR, 0x40012C2C  
.equ R16_TIM1_RPTCR, 0x40012C30  
.equ R16_TIM1_CH1CVR, 0x40012C34  
.equ R16_TIM1_CH2CVR, 0x40012C38
.equ R16_TIM1_CH3CVR, 0x40012C3C  
.equ R16_TIM1_CH4CVR, 0x40012C40  
.equ R16_TIM1_BDTR, 0x40012C44  
.equ R16_TIM1_DMACFGR, 0x40012C48  
.equ R16_TIM1_DMAADR, 0x40012C4C 
.equ R16_TIM8_CTLR1, 0x40013400 
.equ R16_TIM8_CTLR2, 0x40013404  
.equ R16_TIM8_SMCFGR, 0x40013408 
.equ R16_TIM8_DMAINTENR, 0x4001340C 
.equ R16_TIM8_INTFR, 0x40013410 
.equ R16_TIM8_SWEVGR, 0x40013414  
.equ R16_TIM8_CHCTLR1, 0x40013418  
.equ R16_TIM8_CHCTLR2, 0x4001341C 
.equ R16_TIM8_CCER, 0x40013420 
.equ R16_TIM8_CNT, 0x40013424 
.equ R16_TIM8_PSC, 0x40013428 
.equ R16_TIM8_ATRLR, 0x4001342C 
.equ R16_TIM8_RPTCR, 0x40013430  
.equ R16_TIM8_CH1CVR, 0x40013434 
.equ R16_TIM8_CH2CVR, 0x40013438  
.equ R16_TIM8_CH3CVR, 0x4001343C 
.equ R16_TIM8_CH4CVR, 0x40013440  
.equ R16_TIM8_BDTR, 0x40013444  
.equ R16_TIM8_DMACFGR, 0x40013448 
.equ R16_TIM8_DMAADR, 0x4001344C 
.equ R16_TIM9_CTLR1, 0x40014C00 
.equ R16_TIM9_CTLR2, 0x40014C04 
.equ R16_TIM9_SMCFGR, 0x40014C08  
.equ R16_TIM9_DMAINTENR, 0x40014C0C 
.equ R16_TIM9_INTFR, 0x40014C10 
.equ R16_TIM9_SWEVGR, 0x40014C14  
.equ R16_TIM9_CHCTLR1, 0x40014C18  
.equ R16_TIM9_CHCTLR2, 0x40014C1C  
.equ R16_TIM9_CCER, 0x40014C20 
.equ R16_TIM9_CNT, 0x40014C24 
.equ R16_TIM9_PSC, 0x40014C28  
.equ R16_TIM9_ATRLR, 0x40014C2C  
.equ R16_TIM9_RPTCR, 0x40014C30  
.equ R16_TIM9_CH1CVR, 0x40014C34 
.equ R16_TIM9_CH2CVR, 0x40014C38  
.equ R16_TIM9_CH3CVR, 0x40014C3C  
.equ R16_TIM9_CH4CVR, 0x40014C40  
.equ R16_TIM9_BDTR, 0x40014C44 
.equ R16_TIM9_DMACFGR, 0x40014C48  
.equ R16_TIM9_DMAADR, 0x40014C4C  
.equ R16_TIM10_CTLR1, 0x40015000  
.equ R16_TIM10_CTLR2, 0x40015004 
.equ R16_TIM10_SMCFGR, 0x40015008 
.equ R16_TIM10_DMAINTENR, 0x4001500C  
.equ R16_TIM10_INTFR, 0x40015010  
.equ R16_TIM10_SWEVGR, 0x40015014  
.equ R16_TIM10_CHCTLR1, 0x40015018 
.equ R16_TIM10_CHCTLR2, 0x4001501C
.equ R16_TIM10_CCER, 0x40015020 
.equ R16_TIM10_CNT, 0x40015024 
.equ R16_TIM10_PSC, 0x40015028 
.equ R16_TIM10_ATRLR, 0x4001502C 
.equ R16_TIM10_RPTCR, 0x40015030 
.equ R16_TIM10_CH1CVR, 0x40015034 
.equ R16_TIM10_CH2CVR, 0x40015038 
.equ R16_TIM10_CH3CVR, 0x4001503C 
.equ R16_TIM10_CH4CVR, 0x40015040  
.equ R16_TIM10_BDTR, 0x40015044  
.equ R16_TIM10_DMACFGR, 0x40015048 
.equ R16_TIM10_DMAADR, 0x4001504C 
.equ R16_TIM2_CTLR1, 0x40000000 
.equ R16_TIM2_CTLR2, 0x40000004 
.equ R16_TIM2_SMCFGR, 0x40000008 
.equ R16_TIM2_DMAINTENR, 0x4000000C 
.equ R16_TIM2_INTFR, 0x40000010 
.equ R16_TIM2_SWEVGR, 0x40000014  
.equ R16_TIM2_CHCTLR1, 0x40000018  
.equ R16_TIM2_CHCTLR2, 0x4000001C 
.equ R16_TIM2_CCER, 0x40000020  
.equ R16_TIM2_CNT, 0x40000024
.equ R16_TIM2_PSC, 0x40000028
.equ R16_TIM2_ATRLR, 0x4000002C
.equ R16_TIM2_CH1CVR, 0x40000034 
.equ R16_TIM2_CH2CVR, 0x40000038
.equ R16_TIM2_CH3CVR, 0x4000003C 
.equ R16_TIM2_CH4CVR, 0x40000040 
.equ R16_TIM2_DMACFGR, 0x40000048  
.equ R16_TIM2_DMAADR, 0x4000004C 
.equ R16_TIM3_CTLR1, 0x40000400  
.equ R16_TIM3_CTLR2, 0x40000404 
.equ R16_TIM3_SMCFGR, 0x40000408 
.equ R16_TIM3_DMAINTENR, 0x4000040C 
.equ R16_TIM3_INTFR, 0x40000410 
.equ R16_TIM3_SWEVGR, 0x40000414 
.equ R16_TIM3_CHCTLR1, 0x40000418
.equ R16_TIM3_CHCTLR2, 0x4000041C 
.equ R16_TIM3_CCER, 0x40000420 
.equ R16_TIM3_CNT, 0x40000424 
.equ R16_TIM3_PSC, 0x40000428 
.equ R16_TIM3_ATRLR, 0x4000042C 
.equ R16_TIM3_CH1CVR, 0x40000434 
.equ R16_TIM3_CH2CVR, 0x40000438
.equ R16_TIM3_CH3CVR, 0x4000043C 
.equ R16_TIM3_CH4CVR, 0x40000440  
.equ R16_TIM3_DMACFGR, 0x40000448  
.equ R16_TIM3_DMAADR, 0x4000044C  
.equ R16_TIM4_CTLR1, 0x40000800  
.equ R16_TIM4_CTLR2, 0x40000804 
.equ R16_TIM4_SMCFGR, 0x40000808 
.equ R16_TIM4_DMAINTENR, 0x4000080C 
.equ R16_TIM4_INTFR, 0x40000810 
.equ R16_TIM4_SWEVGR, 0x40000814 
.equ R16_TIM4_CHCTLR1, 0x40000818 
.equ R16_TIM4_CHCTLR2, 0x4000081C 
.equ R16_TIM4_CCER, 0x40000820 
.equ R16_TIM4_CNT, 0x40000824 
.equ R16_TIM4_PSC, 0x40000828 
.equ R16_TIM4_ATRLR, 0x4000082C 
.equ R16_TIM4_CH1CVR, 0x40000834 
.equ R16_TIM4_CH2CVR, 0x40000838 
.equ R16_TIM4_CH3CVR, 0x4000083C  
.equ R16_TIM4_CH4CVR, 0x40000840  
.equ R16_TIM4_DMACFGR, 0x40000848 
.equ R16_TIM4_DMAADR, 0x4000084C 
.equ R16_TIM5_CTLR1, 0x40000C00  
.equ R16_TIM5_CTLR2, 0x40000C04 
.equ R16_TIM5_SMCFGR, 0x40000C08  
.equ R16_TIM5_DMAINTENR, 0x40000C0C
.equ R16_TIM5_INTFR, 0x40000C10 
.equ R16_TIM5_SWEVGR, 0x40000C14 
.equ R16_TIM5_CHCTLR1, 0x40000C18 
.equ R16_TIM5_CHCTLR2, 0x40000C1C 
.equ R16_TIM5_CCER, 0x40000C20 
.equ R16_TIM5_CNT, 0x40000C24 
.equ R16_TIM5_PSC, 0x40000C28 
.equ R16_TIM5_ATRLR, 0x40000C2C
.equ R16_TIM5_CH1CVR, 0x40000C34 
.equ R16_TIM5_CH2CVR, 0x40000C38 
.equ R16_TIM5_CH3CVR, 0x40000C3C 
.equ R16_TIM5_CH4CVR, 0x40000C40 
.equ R16_TIM5_DMACFGR, 0x40000C48 
.equ R16_TIM5_DMAADR, 0x40000C4C 
.equ R16_TIM4_CTLR1, 0x40000800  
.equ R16_TIM4_CTLR2, 0x40000804  
.equ R16_TIM4_SMCFGR, 0x40000808  
.equ R16_TIM4_DMAINTENR, 0x4000080C 
.equ R16_TIM4_INTFR, 0x40000810  
.equ R16_TIM4_SWEVGR, 0x40000814  
.equ R16_TIM4_CHCTLR1, 0x40000818 
.equ R16_TIM4_CHCTLR2, 0x4000081C
.equ R16_TIM4_CCER, 0x40000820 
.equ R16_TIM4_CNT, 0x40000824 
.equ R16_TIM4_PSC, 0x40000828 
.equ R16_TIM4_ATRLR, 0x4000082C  
.equ R16_TIM4_CH1CVR, 0x40000834  
.equ R16_TIM4_CH2CVR, 0x40000838 
.equ R16_TIM4_CH3CVR, 0x4000083C  
.equ R16_TIM4_CH4CVR, 0x40000840  
.equ R16_TIM4_DMACFGR, 0x40000848  
.equ R16_TIM4_DMAADR, 0x4000084C 
.equ R16_TIM5_CTLR1, 0x40000C00 
.equ R16_TIM5_CTLR2, 0x40000C04
.equ R16_TIM5_SMCFGR, 0x40000C08 
.equ R16_TIM5_DMAINTENR, 0x40000C0C 
.equ R16_TIM5_INTFR, 0x40000C10 
.equ R16_TIM5_SWEVGR, 0x40000C14 
.equ R16_TIM5_CHCTLR1, 0x40000C18 
.equ R16_TIM5_CHCTLR2, 0x40000C1C  
.equ R16_TIM5_CCER, 0x40000C20 
.equ R16_TIM5_CNT, 0x40000C24 
.equ R16_TIM5_PSC, 0x40000C28 
.equ R16_TIM5_ATRLR, 0x40000C2C 
.equ R16_TIM5_CH1CVR, 0x40000C34 
.equ R16_TIM5_CH2CVR, 0x40000C38 
.equ R16_TIM5_CH3CVR, 0x40000C3C
.equ R16_TIM5_CH4CVR, 0x40000C40 
.equ R16_TIM5_DMACFGR, 0x40000C48 
.equ R16_TIM5_DMAADR, 0x40000C4C  
.equ R16_TIM6_CTLR1 ,0x40001000 
.equ R16_TIM6_CTLR2, 0x40001004 
.equ R16_TIM6_DMAINTENR, 0x4000100C 
.equ R16_TIM6_INTFR,0x40001010 
.equ R16_TIM6_SWEVGR ,0x40001014 
.equ R16_TIM6_CNT ,0x40001024 
.equ R16_TIM6_PSC ,0x40001028 
.equ R16_TIM6_ATRLR,0x4000102C 
.equ R16_TIM7_CTLR1 ,0x40001400 
.equ R16_TIM7_CTLR2 ,0x40001404 
.equ R16_TIM7_DMAINTENR, 0x4000140C 
.equ R16_TIM7_INTFR,0x40001410 
.equ R16_TIM7_CNT, 0x40001424 
.equ R16_TIM7_PSC, 0x40001428 
.equ R16_TIM7_ATRLR, 0x4000142C 
.equ R32_DAC_CTLR, 0x40007400 
.equ 0x40007404 
.equ R32_DAC_R12BDHR1, 0x40007408 
.equ R32_DAC_L12BDHR1, 0x4000740C ,
.equ R32_DAC_R8BDHR1, 0x40007410 
.equ R32_DAC_R12BDHR2, 0x40007414 
.equ R32_DAC_L12BDHR2, 0x40007418 
.equ R32_DAC_R8BDHR2, 0x4000741C 
.equ R32_DAC_RD12BDHR, 0x40007420 
.equ R32_DAC_LD12BDHR, 0x40007424 
.equ R32_DAC_RD8BDHR, 0x40007428 
.equ R32_DAC_DOR1, 0x4000742C 
.equ R32_DAC_DOR2, 0x40007430 
.equ R32_USART1_STATR,0x40013800 
.equ R32_USART1_DATAR, 0x40013804 
.equ R32_USART1_BRR ,0x40013808 
.equ R32_USART1_CTLR1 ,0x4001380C 
.equ R32_USART1_CTLR2 ,0x40013810 
.equ R32_USART1_CTLR3 ,0x40013814 
.equ R32_USART1_GPR ,0x40013818 
.equ R32_USART2_STATR, 0x40004400  
.equ R32_USART2_DATAR, 0x40004404 
.equ R32_USART2_BRR, 0x40004408 
.equ R32_USART2_CTLR1, 0x4000440C 
.equ R32_USART2_CTLR2, 0x40004410 
.equ R32_USART2_CTLR3, 0x40004414 
.equ R32_USART2_GPR, 0x40004418 
.equ R32_USART3_STATR, 0x40004800
.equ R32_USART3_DATAR, 0x40004804 
.equ R32_USART3_BRR, 0x40004808  
.equ R32_USART3_CTLR1, 0x4000480C 
.equ R32_USART3_CTLR2, 0x40004810  
.equ R32_USART3_CTLR3, 0x40004814 
.equ R32_USART3_GPR, 0x40004818 
.equ R32_UART4_STATR ,0x40004C00 
.equ R32_UART4_DATAR ,0x40004C04 
.equ R32_UART4_BRR, 0x40004C08  
.equ R32_UART4_CTLR1, 0x40004C0C 
.equ R32_UART4_CTLR2, 0x40004C10 
.equ R32_UART4_CTLR3, 0x40004C14  
.equ R32_UART4_GPR, 0x40004C18 
.equ R32_UART5_STATR, 0x40005000  
.equ R32_UART5_DATAR, 0x40005004 
.equ R32_UART5_BRR, 0x40005008 
.equ R32_UART5_CTLR1, 0x4000500C 
.equ R32_UART5_CTLR2, 0x40005010 
.equ R32_UART5_CTLR3, 0x40005014  
.equ R32_UART5_GPR, 0x40005018  
.equ R32_UART6_STATR, 0x40001800 
.equ R32_UART6_DATAR, 0x40001804 
.equ R32_UART6_BRR, 0x40001808 
.equ R32_UART6_CTLR1, 0x4000180C 
.equ R32_UART6_CTLR2, 0x40001810  
.equ R32_UART6_CTLR3, 0x40001814 
.equ R32_UART6_GPR, 0x40001818 
.equ R32_UART7_STATR, 0x40001C00 
.equ R32_UART7_DATAR, 0x40001C04 
.equ R32_UART7_BRR, 0x40001C08 
.equ R32_UART7_CTLR1, 0x40001C0C 
.equ R32_UART7_CTLR2, 0x40001C10 
.equ R32_UART7_CTLR3, 0x40001C14 
.equ R32_UART7_GPR, 0x40001C18
.equ R32_UART8_STATR, 0x40002000 
.equ R32_UART8_DATAR, 0x40002004
.equ R32_UART8_BRR, 0x40002008 
.equ R32_UART8_CTLR1, 0x4000200C 
.equ R32_UART8_CTLR2, 0x40002010 
.equ R32_UART8_CTLR3, 0x40002014 
.equ R32_UART8_GPR, 0x40002018 


