sahasradal/ch32v203_/ch32v203.inc
.equ R16_I2C1_CTLR1 ,0x40005400 
.equ R16_I2C1_CTLR2 ,0x40005404 
.equ R16_I2C1_OADDR1 ,0x40005408 
.equ R16_I2C1_OADDR2,0x4000540C 
.equ R16_I2C1_DATAR ,0x40005410 
.equ R16_I2C1_STAR1 ,0x40005414 
.equ R16_I2C1_STAR2 ,0x40005418 
.equ R16_I2C1_CKCFGR ,0x4000541C 
.equ R16_I2C1_RTR ,0x40005420 
.equ R16_I2C2_CTLR1,0x40005800 
.equ R16_I2C2_CTLR2, 0x40005804 
.equ R16_I2C2_OADDR1, 0x40005808 
.equ R16_I2C2_OADDR2, 0x4000580C 
.equ R16_I2C2_DATAR, 0x40005810 
.equ R16_I2C2_STAR1, 0x40005814 
.equ R16_I2C2_STAR2, 0x40005818 
.equ R16_I2C2_CKCFGR, 0x4000581C 
.equ R16_I2C2_RTR, 0x40005820 
.equ R16_SPI1_CTLR1, 0x40013000 
.equ R16_SPI1_CTLR2 ,0x40013004 
.equ R16_SPI1_STATR ,0x40013008 
.equ R16_SPI1_DATAR ,0x4001300C 
.equ R16_SPI1_CRCR ,0x40013010 
.equ R16_SPI1_RCRCR ,0x40013014 
.equ R16_SPI1_TCRCR, 0x40013018 
.equ R16_SPI1_I2S_CFGR, 0x4001301C
.equ R16_SPI1_HSCR, 0x40013024 
.equ R16_SPI2_CTLR1, 0x40003800 
.equ R16_SPI2_CTLR2, 0x40003804 
.equ R16_SPI2_STATR, 0x40003808
.equ R16_SPI2_DATAR, 0x4000380C 
.equ R16_SPI2_CRCR, 0x40003810 
.equ R16_SPI2_RCRCR, 0x40003814 
.equ R16_SPI2_TCRCR, 0x40003818 
.equ R16_SPI2_I2S_CFGR, 0x4000381C 
.equ R16_SPI2_I2SPR, 0x40003820 
.equ R16_SPI2_HSCR, 0x40003824 
.equ R16_SPI3_CTLR1, 0x40003C00
.equ R16_SPI3_CTLR2, 0x40003C04 
.equ R16_SPI3_STATR, 0x40003C08  
.equ R16_SPI3_DATAR, 0x40003C0C 
.equ R16_SPI3_CRCR, 0x40003C10 
.equ R16_SPI3_RCRCR, 0x40003C14 
.equ R16_SPI3_TCRCR, 0x40003C18 
.equ R16_SPI3_I2S_CFGR, 0x40003C1C 
.equ R16_SPI3_I2SPR, 0x40003C20  
.equ R16_SPI3_HSCR, 0x40003C24  
.equ R16_USBD_CNTR, 0x40005C40 
.equ R16_USBD_ISTR, 0x40005C44  
.equ R16_USBD_FNR, 0x40005C48 
.equ R16_USBD_DADDR, 0x40005C4C 
.equ R16_USBD_BTABL,E 0x40005C50 
.equ R16_USBD_EPR0, 0x40005C00 
.equ R16_USBD_EPR1, 0x40005C04  
.equ R16_USBD_EPR2, 0x40005C08 
.equ R16_USBD_EPR3, 0x40005C0C  
.equ R16_USBD_EPR4, 0x40005C10 
.equ R16_USBD_EPR5, 0x40005C14  
.equ R16_USBD_EPR6, 0x40005C18  
.equ R16_USBD_EPR7, 0x40005C1C 
.equ R16_USBD_ADDR0_TX, 0x40006000+[USBD_BTABLE] 
.equ R16_USBD_COUNT0_TX ,0x40006004+[USBD_BTABLE]
.equ R16_USBD_ADDR0_RX, 0x40006008+[USBD_BTABLE] 
.equ R16_USBD_COUNT0_RX, 0x4000600C+[USBD_BTABLE]
.equ R16_USBD_ADDR1_TX, 0x40006010+[USBD_BTABLE] 
.equ R16_USBD_COUNT1_TX, 0x40006014+[USBD_BTABLE]
.equ R16_USBD_ADDR1_RX, 0x40006018+[USBD_BTABLE] 

.equ R16_USBD_COUNT1_RX 0x4000601C+[USBD_BTABLE] Endpoint receive byte count 
register1 0x0000 
.equ R16_USBD_ADDR2_TX 0x40006020+[USBD_BTABLE] Endpoint transmit buffer address 
register2 0x0000 
.equ R16_USBD_COUNT2_TX 0x40006024+[USBD_BTABLE] Endpoint transmit byte count 
register2 0x0000 
.equ R16_USBD_ADDR2_RX 0x40006028+[USBD_BTABLE] Endpoint receive buffer address 
register2 0x0000 
.equ R16_USBD_COUNT2_RX 0x4000602C+[USBD_BTABLE] Endpoint receive byte count 
register2 0x0000 
.equ R16_USBD_ADDR3_TX 0x40006030+[USBD_BTABLE] Endpoint transmit buffer address 
register3 0x0000 
.equ R16_USBD_COUNT3_TX 0x40006034+[USBD_BTABLE] Endpoint transmit byte count 
register3 0x0000 
.equ R16_USBD_ADDR3_RX 0x40006038+[USBD_BTABLE] Endpoint receive buffer address 
register3 0x0000 
.equ R16_USBD_COUNT3_RX 0x4000603C+[USBD_BTABLE] Endpoint receive byte count 
register3 0x0000 
.equ R16_USBD_ADDR4_TX 0x40006040+[USBD_BTABLE] Endpoint transmit buffer address 
register4 0x0000 
.equ R16_USBD_COUNT4_TX 0x40006044+[USBD_BTABLE] Endpoint transmit byte count 
register4 0x0000 
.equ R16_USBD_ADDR4_RX 0x40006048+[USBD_BTABLE] Endpoint receive buffer address 
register4 0x0000 
.equ R16_USBD_COUNT4_RX 0x4000604C+[USBD_BTABLE] Endpoint receive byte count 
register4 0x0000 
.equ R16_USBD_ADDR5_TX 0x40006050+[USBD_BTABLE] Endpoint transmit buffer address 
register5 0x0000 
.equ R16_USBD_COUNT5_TX 0x40006054+[USBD_BTABLE] Endpoint transmit byte count 
register 5 0x0000 
.equ R16_USBD_ADDR5_RX 0x40006058+[USBD_BTABLE] Endpoint receive buffer address 
register5 0x0000 
.equ R16_USBD_COUNT5_RX 0x4000605C+[USBD_BTABLE] Endpoint receive byte count 
register5 0x0000 
.equ R16_USBD_ADDR6_TX 0x40006060+[USBD_BTABLE] Endpoint transmit buffer address 
register6 0x0000 
.equ R16_USBD_COUNT6_TX 0x40006064+[USBD_BTABLE] Endpoint transmit byte count 
register6 0x0000 
.equ R16_USBD_ADDR6_RX 0x40006068+[USBD_BTABLE] Endpoint receive buffer address 
register6 0x0000 
.equ R16_USBD_COUNT6_RX 0x4000606C+[USBD_BTABLE] Endpoint receive byte count 
register6 0x0000 
.equ R16_USBD_ADDR7_TX 0x40006070+[USBD_BTABLE] Endpoint transmit buffer address 
register7 0x0000 
.equ R16_USBD_COUNT7_TX 0x40006074+[USBD_BTABLE] Endpoint transmit byte count 0x0000 
CH32FV2x_V3x Reference Manual  http://wch.cn 
V1.7 332     
register7 
.equ R16_USBD_ADDR7_RX 0x40006078+[USBD_BTABLE] Endpoint receive buffer address 
register7 0x0000 
.equ R16_USBD_COUNT7_RX 0x4000607C+[USBD_BTABLE] Endpoint receive byte count 
register7 0x0000


.equ R8_USB_CTRL 
Reset value 
0x40023400 
USB control register 
.equ R8_USB_INT_EN 
0x06 
0x40023402 
USB interrupt enable register 
.equ R8_USB_DEV_AD 
0 
0x40023403 
USB device address register 
.equ R16_USB_FRAME_NO 
0 
0x40023404 
USB frame number register 
.equ R8_USB_SUSPEND 
0 
0x40023406 
USB suspend register 
.equ R8_USB_SPPED_TYPE 
0 
0x40023408 
USB current speed type register 
.equ R8_USB_MIS_ST 
0 
0x40023409 
USB miscellaneous status register 
.equ R8_USB_INT_FG 
xx10_1000b 
0x4002340A 
USB interrupt flag register 
.equ R8_USB_INT_ST 
0 
0x4002340B 
USB interrupt status register 
.equ R16_USB_RX_LEN 
00xx_xxxxb 
0x4002340C 
USB receive length register 
xx 





.equ R32_UEP_CONFIG 0x40023410 Endpoint enable configuration register 00000000h 
.equ R32_UEP_TYPE 0x40023414 Endpoint type configuration register 00000000h 
.equ R32_UEP_BUF_MOD 0x40023418 Endpoint buffer mode register 00000000h 
.equ R32_UEP0_DMA 0x4002341C Endpoint0 buffer start address xxxxh 
.equ R32_UEP1_RX_DMA 0x40023420 Endpoint1 receive buffer start address xxxxh 
.equ R32_UEP2_RX_DMA 0x40023424 Endpoint2 receive buffer start address xxxxh 
.equ R32_UEP3_RX_DMA 0x40023428 Endpoint3 receive buffer start address xxxxh 
.equ R32_UEP4_RX_DMA 0x4002342C Endpoint4 receive buffer start address xxxxh 
.equ R32_UEP5_RX_DMA 0x40023430 Endpoint5 receive buffer start address xxxxh 
.equ R32_UEP6_RX_DMA 0x40023434 Endpoint6 receive buffer start address xxxxh 
.equ R32_UEP7_RX_DMA 0x40023438 Endpoint7 receive buffer start address xxxxh 
.equ R32_UEP8_RX_DMA 0x4002343C Endpoint8 receive buffer start address xxxxh 
.equ R32_UEP9_RX_DMA 0x40023440 Endpoint9 receive buffer start address xxxxh 
.equ R32_UEP10_RX_DMA 0x40023444 Endpoint10 receive buffer start address xxxxh 
.equ R32_UEP11_RX_DMA 0x40023448 Endpoint11 receive buffer start address xxxxh 
.equ R32_UEP12_RX_DMA 0x4002344C Endpoint12 receive buffer start address xxxxh 
.equ R32_UEP13_RX_DMA 0x40023450 Endpoint13 receive buffer start address xxxxh 
.equ R32_UEP14_RX_DMA 0x40023454 Endpoint14 receive buffer start address xxxxh 
.equ R32_UEP15_RX_DMA 0x40023458 Endpoint15 receive buffer start address xxxxh 
.equ R32_UEP1_TX_DMA 0x4002345C Endpoint1 transmit buffer start address xxxxh 
.equ R32_UEP2_TX_DMA 0x40023460 Endpoint2 transmit buffer start address xxxxh 
.equ R32_UEP3_TX_DMA 0x40023464 Endpoint3 transmit buffer start address xxxxh 
.equ R32_UEP4_TX_DMA 0x40023468 Endpoint4 transmit buffer start address xxxxh 
CH32FV2x_V3x Reference Manual  http://wch.cn 
V1.7 353     
.equ R32_UEP5_TX_DMA 0x4002346C Endpoint5 transmit buffer start address xxxxh 
.equ R32_UEP6_TX_DMA 0x40023470 Endpoint6 transmit buffer start address xxxxh 
.equ .equ R32_UEP7_TX_DMA 0x40023474 Endpoint7 transmit buffer start address xxxxh 
.equ R32_UEP8_TX_DMA 0x40023478 Endpoint8 transmit buffer start address xxxxh 
.equ R32_UEP9_TX_DMA 0x4002347C Endpoint9 transmit buffer start address xxxxh 
.equ R32_UEP10_TX_DMA 0x40023480 Endpoint10 transmit buffer start address xxxxh 
.equ R32_UEP11_TX_DMA 0x40023484 Endpoint11 transmit buffer start address xxxxh 
.equ R32_UEP12_TX_DMA 0x40023488 Endpoint12 transmit buffer start address xxxxh 
.equ R32_UEP13_TX_DMA 0x4002348C Endpoint13 transmit buffer start address xxxxh 
.equ R32_UEP14_TX_DMA 0x40023490 Endpoint14 transmit buffer start address xxxxh 
.equ R32_UEP15_TX_DMA 0x40023494 Endpoint15 transmit buffer start address xxxxh 
.equ R16_UEP0_MAX_LEN 0x40023498 Endpoint0 maximum length packet 
register xxxxh 
.equ R16_UEP1_MAX_LEN 0x4002349C Endpoint1 maximum length packet 
register xxxxh 
.equ R16_UEP2_MAX_LEN 0x400234A0 Endpoint2 maximum length packet 
register xxxxh 
.equ R16_UEP3_MAX_LEN 0x400234A4 Endpoint3 maximum length packet 
register xxxxh 
.equ R16_UEP4_MAX_LEN 0x400234A8 Endpoint4 maximum length packet 
register xxxxh 
.equ R16_UEP5_MAX_LEN 0x400234AC Endpoint5 maximum length packet 
register xxxxh 
.equ R16_UEP6_MAX_LEN 0x400234B0 Endpoint6 maximum length packet 
register xxxxh 
.equ R16_UEP7_MAX_LEN 0x400234B4 Endpoint7 maximum length packet 
register xxxxh 
.equ R16_UEP8_MAX_LEN 0x400234B8 Endpoint8 maximum length packet 
register xxxxh 
.equ R16_UEP9_MAX_LEN 0x400234BC Endpoint9 maximum length packet 
register xxxxh 
.equ R16_UEP10_MAX_LEN 0x400234C0 Endpoint10 maximum length packet 
register xxxxh 
.equ R16_UEP11_MAX_LEN 0x400234C4 Endpoint11 maximum length packet 
register xxxxh 
.equ R16_UEP12_MAX_LEN 0x400234C8 Endpoint12 maximum length packet 
register xxxxh 
.equ R16_UEP13_MAX_LEN 0x400234CC Endpoint13 maximum length packet 
register xxxxh 
.equ R16_UEP14_MAX_LEN 0x400234D0 Endpoint14 maximum length packet 
register xxxxh 
.equ R16_UEP15_MAX_LEN 0x400234D4 Endpoint15 maximum length packet 
register xxxxh 
.equ R16_UEP0_T_LEN 0x400234D8 Endpoint0 transmit length register xxxxh 
.equ R8_UEP0_TX_CTRL 0x400234DA Endpoint0 transmit control register 00h 
CH32FV2x_V3x Reference Manual  http://wch.cn 
V1.7 354     
.equ R8_UEP0_RX_CTRL 0x400234DB Endpoint0 receive control register 00h 
.equ R16_UEP1_T_LEN 0x400234DC Endpoint1 transmit length register xxxxh 
.equ R8_UEP1_TX_CTRL 0x400234DE Endpoint1 transmit control register 00h 
.equ R8_UEP1_RX_CTRL 0x400234DF Endpoint1 receive control register 00h 
.equ R16_UEP2_T_LEN 0x400234E0 Endpoint2 transmit length register xxxxh 
.equ R8_UEP2_TX_CTRL 0x400234E2 Endpoint2 transmit control register 00h 
.equ R8_UEP2_RX_CTRL 0x400234E3 Endpoint2 receive control register 00h 
.equ R16_UEP3_T_LEN 0x400234E4 Endpoint3 transmit length register xxxxh 
.equ R8_UEP3_TX_CTRL 0x400234E6 Endpoint3 transmit control register 00h 
.equ R8_UEP3_RX_CTRL 0x400234E7 Endpoint3 receive control register 00h 
.equ R16_UEP4_T_LEN 0x400234E8 Endpoint4 transmit length register xxxxh 
.equ R8_UEP4_TX_CTRL 0x400234EA Endpoint4 transmit control register 00h 
.equ R8_UEP4_RX_CTRL 0x400234EB Endpoint4 receive control register 00h 
.equ R16_UEP5_T_LEN 0x400234EC Endpoint5 transmit length register xxxxh 
.equ R8_UEP5_TX_CTRL 0x400234EE Endpoint5 transmit control register 00h 
.equ R8_UEP5_RX_CTRL 0x400234EF Endpoint5 receive control register 00h 
.equ R16_UEP6_T_LEN 0x400234F0 Endpoint6 transmit length register xxxxh 
.equ R8_UEP6_TX_CTRL 0x400234F2 Endpoint6 transmit control register 00h 
.equ R8_UEP6_RX_CTRL 0x400234F3 Endpoint6 receive control register 00h 
.equ R16_UEP7_T_LEN 0x400234F4 Endpoint7 transmit length register xxxxh 
.equ R8_UEP7_TX_CTRL 0x400234F6 Endpoint7 transmit control register 00h 
.equ R8_UEP7_RX_CTRL 0x400234F7 Endpoint7 receive control register 00h 
.equ R16_UEP8_T_LEN 0x400234F8 Endpoint8 transmit length register xxxxh 
.equ R8_UEP8_TX_CTRL 0x400234FA Endpoint8 transmit control register 00h 
.equ R8_UEP8_RX_CTRL 0x400234FB Endpoint8 receive control register 00h 
.equ R16_UEP9_T_LEN 0x400234FC Endpoint9 transmit length register xxxxh 
.equ R8_UEP9_TX_CTRL 0x400234FE Endpoint9 transmit control register 00h 
.equ R8_UEP9_RX_CTRL 0x400234FF Endpoint9 receive control register 00h 
.equ R16_UEP10_T_LEN 0x40023500 Endpoint10 transmit length register xxxxh 
.equ R8_UEP10_TX_CTRL 0x40023502 Endpoint10 transmit control register 00h 
.equ R8_UEP10_RX_CTRL 0x40023503 Endpoint10 receive control register 00h 
.equ R16_UEP11_T_LEN 0x40023504 Endpoint11 transmit length register xxxxh 
.equ R8_UEP11_TX_CTRL 0x40023506 Endpoint11 transmit control register 00h 
.equ R8_UEP11_RX_CTRL 0x40023507 Endpoint11 receive control register 00h 
.equ R16_UEP12_T_LEN 0x40023508 Endpoint12 transmit length register xxxxh 
.equ R8_UEP12_TX_CTRL 0x4002350A Endpoint12 transmit control register 00h 
.equ R8_UEP12_RX_CTRL 0x4002350B Endpoint12 receive control register 00h 
.equ R16_UEP13_T_LEN 0x4002350C Endpoint13 transmit length register xxxxh 
.equ R8_UEP13_TX_CTRL 0x4002350E Endpoint13 transmit control register 00h 
.equ R8_UEP13_RX_CTRL 0x4002350F Endpoint13 receive control register 00h 
.equ R16_UEP14_T_LEN 0x40023510 Endpoint14 transmit length register xxxxh 
.equ R8_UEP14_TX_CTRL 0x40023512 Endpoint14 transmit control register 00h 
.equ R8_UEP14_RX_CTRL 0x40023513 Endpoint14 receive control register 00h 
CH32FV2x_V3x Reference Manual  
http://wch.cn 
.equ R16_UEP15_T_LEN 
0x40023514 
Endpoint15 transmit length register 
.equ R8_UEP15_TX_CTRL 
xxxxh 
0x40023516 
Endpoint15 transmit control register 
.equ R8_UEP15_RX_CTRL 
00h 
0x40023517 
Endpoint15 receive control register 


.equ R8_USB_CTRL 
0x50000000 
USB control register 
Reset value 
.equ R8_USB_INT_EN 
0x06 
0x50000002 
USB interrupt enable register 
.equ R8_USB_DEV_AD 
0x00 
0x50000003 
USB Device address register 
.equ R32_USB_STATUS 
0x00 
0x50000004 
USB status register 
.equ R8_USB_MIS_ST 
0xXX20XXXX 
0x50000005 
USB miscellaneous status register 
.equ R8_USB_INT_FG 
0xXX 
0x50000006 
USB interrupt flag register 
.equ R8_USB_INT_ST 
0x20 
0x50000007 
USB interrupt status register 
.equ R16_USB_RX_LEN 
0xXX 
0x50000008 
USB receive length register 
.equ R32_USB_OTG_CR 
0xXX 
0x50000054 
USB OTG control register 
.equ R32_USB_OTG_SR 
0x00 
0x50000058 
USB OTG status register





.equ R8_UDEV_CTRL 0x50000001 USB device physical port control 
register 0xX0 
.equ R8_UEP4_1_MOD 0x5000000C Endpoint 1(9)/4(8/12) mode control 
register 0x00 
.equ R8_UEP2_3_MOD 0x5000000D Endpoint 2(10)/3(11) mode control 
register 0x00 
.equ R8_UEP5_6_MOD 0x5000000E Endpoint 5(13)/6(14) mode control 
register 0x00 
.equ R8_UEP7_MOD 0x5000000F Endpoint 7(15) mode control register 0x00 
.equ R16_UEP0_DMA 0x50000010 Endpoint 0 buffer start address 0xXXXX 
.equ R16_UEP1_DMA 0x50000014 Endpoint 1(9) buffer start address 0xXXXX 
.equ R16_UEP2_DMA 0x50000018 Endpoint 2 (10) buffer start address 0xXXXX 
.equ R16_UEP3_DMA 0x5000001C Endpoint 3 (11) buffer start address 0xXXXX 
.equ R16_UEP4_DMA 0x50000020 Endpoint 4 (8/12) buffer start address 0xXXXX 
.equ R16_UEP5_DMA 0x50000024 Endpoint 5(13) buffer start address 0xXXXX 
.equ R16_UEP6_DMA 0x50000028 Endpoint 6(14) buffer start address 0xXXXX 
.equ R16_UEP7_DMA 0x5000002C Endpoint 7(15) buffer start address 0xXXXX 
.equ R8_UEP0_T_LEN 0x50000030 Endpoint 0 transmit length register 0xXX 
.equ R8_UEP0_TX_CTRL 0x50000032 Endpoint 0 transmit control register 0x00 
.equ R8_UEP0_RX_CTRL 0x50000033 Endpoint 0 receive control register 0x00 
.equ R8_UEP1_T_LEN 0x50000034 Endpoint 1(9) transmit length register 0xXX 
.equ R8_UEP1_TX_CTRL 0x50000036 Endpoint 1(9) transmit control register 0x00 
.equ R8_UEP1_RX_CTRL 0x50000037 Endpoint 1(9) receive control register 0x00 
.equ R8_UEP2_T_LEN 0x50000038 Endpoint 2(10) transmit length 
register 0xXX 
.equ R8_UEP2_TX_CTRL 0x5000003A Endpoint 2(10) transmit control 
register 0x00 
.equ R8_UEP2_RX_CTRL 0x5000003B Endpoint 2(10) receive control 
register 0x00 
.equ R8_UEP3_T_LEN 0x5000003C Endpoint 3(11) transmit length 
register 0xXX 
.equ R8_UEP3_TX_CTRL 0x500003E Endpoint 3(11) transmit control 
register 0x00 
.equ R8_UEP3_RX_CTRL 0x500003F Endpoint 3(11) receive control 
register 0x00 
.equ R8_UEP4_T_LEN 0x50000040 Endpoint 4 (8/12) transmit length 
register 0xXX 
.equ R8_UEP4_TX_CTRL 0x50000042 Endpoint 4 (8/12) transmit control 
register 0x00 
.equ R8_UEP4_RX_CTRL 0x50000043 Endpoint 4 (8/12) receive control 
Register 0x00 
.equ R8_UEP5_T_LEN 0x50000044 Endpoint 5(13) transmit length 
register 0xXX 
CH32FV2x_V3x Reference Manual  http://wch.cn 
V1.7 373     
.equ R8_UEP5_TX_CTRL 0x50000046 Endpoint 5(13) transmit control 
register 0x00 
.equ R8_UEP5_RX_CTRL 0x50000047 Endpoint 5(13) receive control 
register 0x00 
.equ R8_UEP6_T_LEN 0x50000048 Endpoint 6(14) transmit length 
register 0xXX 
.equ R8_UEP6_TX_CTRL 0x5000004A Endpoint 6(14) transmit control 
register 0x00 
.equ R8_UEP6_RX_CTRL 0x5000004B Endpoint 6(14) receive control 
register 0x00 
.equ R8_UEP7_T_LEN 0x5000004C Endpoint 7(15) transmit length 
register 0xXX 
.equ R8_UEP7_TX_CTRL 0x5000004E Endpoint 7(15) transmit control 
register 0x00 
.equ R8_UEP7_RX_CTRL 0x5000004F Endpoint 7(15) receive control 
register 0x00


.equ R8_UHOST_CTRL 0x50000001 USB host physical port control 
register 0xX0 
.equ R32_UH_EP_MOD 0x5000000D USB host endpoint mode control 
register 0x00 
.equ R16_UH_RX_DMA 0x50000018 USB host receive buffer start address X 
.equ R16_UH_TX_DMA 0x5000001C USB host transmit buffer start 
address X 
.equ R16_UH_SETUP 0x50000036 USB host auxiliary setup register 0x00 
.equ R8_UH_EP_PID 0x50000038 USB host token setup register 0x00 
.equ R8_UH_RX_CTRL 0x5000003A USB host receive endpoint control 
register 0x00 
.equ R16_UH_TX_LEN 0x5000003C USB host transmit length register X 
.equ R8_UH_TX_CTRL 0x5000003E USB host transmit endpoint control 
register 0x00 



.equ R32_CAN1_CTLR 0x40006400 CAN1 master control register 0x00010002 
.equ R32_CAN1_STATR 0x40006404 CAN1 master status register 0x00000C02 
.equ R32_CAN1_TSTATR 0x40006408 CAN1 transmit status register 0x1C000000 
.equ R32_CAN1_RFIFO0 0x4000640C CAN1 receive FIFO0 control and status 
register 0x00000000 
.equ R32_CAN1_RFIFO1 0x40006410 CAN1 receive FIFO1 control and status 
register 0x00000000 
.equ R32_CAN1_INTENR 0x40006414 CAN1 interrupt enable register 0x00000000 
.equ R32_CAN1_ERRSR 0x40006418 CAN1 error status register 0x00000000 
.equ R32_CAN1_BTIMR 0x4000641C CAN1 bit timing register 0x01230000 


.equ R32_CAN1_TTCTLR 0x40006420 CAN1 time trigger control register 0x0000FFFF 
.equ R32_CAN1_TTCNT 0x40006424 CAN1 time trigger count value register 0x00000000 
Table 24-6 CAN2 registers 
Name Access address Description Reset value 
.equ R32_CAN2_CTLR 0x40006800 CAN2 master control register 0x00010002 
.equ R32_CAN2_STATR 0x40006804 CAN2 master status register 0x00000C02 
.equ R32_CAN2_TSTATR 0x40006808 CAN2 transmit status register 0x1C000000 
.equ R32_CAN2_RFIFO0 0x4000680C CAN2 receive FIFO0 control and status 
register 0x00000000 
.equ R32_CAN2_RFIFO1 0x40006810 CAN2 receive FIFO1 control and status 
register 0x00000000 
.equ R32_CAN2_INTENR 0x40006814 CAN2 interrupt enable register 0x00000000 
.equ R32_CAN2_ERRSR 0x40006818 CAN2 error status register 0x00000000 
.equ R32_CAN2_BTIMR 0x4000681C CAN2 bit timing register 0x01230000 
.equ R32_CAN2_TTCTLR 0x40006820 CAN2 time trigger control register 0x0000FFFF 
.equ R32_CAN2_TTCNT 0x40006824 CAN2 time trigger count value register 0x00000000 
Table 24-7 CAN1 mailbox registers 
Name Access address Description Reset 
value 
.equ R32_CAN1_TXMIR0 0x40006580 CAN1 Tx mailbox0 identifier register X 
.equ R32_CAN1_TXMDTR0 0x40006584 CAN1 Tx mailbox0 data length and timestamp 
register X 
.equ R32_CAN1_TXMDLR0 0x40006588 CAN1 Tx mailbox0 data low register X 
.equ R32_CAN1_TXMDHR0 0x4000658C CAN1 Tx mailbox0 data high register X 
.equ R32_CAN1_TXMIR1 0x40006590 CAN1 Tx mailbox1 identifier register X 
.equ R32_CAN1_TXMDTR1 0x40006594 CAN1 Tx mailbox1 data length and timestamp 
register X 
.equ R32_CAN1_TXMDLR1 0x40006598 CAN1 Tx mailbox1 data low register X 
.equ R32_CAN1_TXMDHR1 0x4000659C CAN1 Tx mailbox1 data high register X 
.equ R32_CAN1_TXMIR2 0x400065A0 CAN1 Tx mailbox2 identifier register X 
.equ R32_CAN1_TXMDTR2 0x400065A4 CAN1 Tx mailbox2 data length and timestamp 
register X 
.equ R32_CAN1_TXMDLR2 0x400065A8 CAN1 Tx mailbox2 data low register X 
.equ R32_CAN1_TXMDHR2 0x400065AC CAN1 Tx mailbox2 data high register X 
.equ R32_CAN1_RXMIR0 0x400065B0 CAN1 Rx FIFO0 mailbox identifier register X 
.equ R32_CAN1_RXMDTR0 0x400065B4 CAN1 Rx FIFO0 mailbox data length and 
timestamp register X 
.equ R32_CAN1_RXMDLR0 0x400065B8 CAN1 Rx FIFO0 mailbox data low register X 
.equ R32_CAN1_RXMDHR0 0x400065BC CAN1 Rx FIFO0 mailbox data high register X 
.equ R32_CAN1_RXMIR1 0x400065C0 CAN1 Rx FIFO1 mailbox identifier register X 
.equ R32_CAN1_RXMDTR1 0x400065C4 CAN1 Rx FIFO1 mailbox data length and 
timestamp register X 
.equ R32_CAN1_RXMDLR1 0x400065C8 CAN1 Rx FIFO1 mailbox data low register X 
.equ R32_CAN1_RXMDHR1 0x400065CC CAN1 Rx FIFO1 mailbox data high register X 
CH32FV2x_V3x Reference Manual  http://wch.cn 
V1.7 397     
Table 24-8 CAN2 Mailbox registers 
Name Access address Description Reset 
Value 
.equ R32_CAN2_TXMIR0 0x40006980 CAN2 Tx mailbox0 identifier register X 
.equ R32_CAN2_TXMDTR0 0x40006984 CAN2 Tx mailbox0 data length and timestamp 
register X 
.equ R32_CAN2_TXMDLR0 0x40006988 CAN2 Tx mailbox0 data low register X 
.equ R32_CAN2_TXMDHR0 0x4000698C CAN2 Tx mailbox0 data high register X 
.equ R32_CAN2_TXMIR1 0x40006990 CAN2 Tx mailbox1 identifier register X 
.equ R32_CAN2_TXMDTR1 0x40006994 CAN2 Tx mailbox1 data length and timestamp 
register X 
.equ R32_CAN2_TXMDLR1 0x40006998 CAN2 Tx mailbox1 data low register X 
.equ R32_CAN2_TXMDHR1 0x4000699C CAN2 Tx mailbox1 data high register X 
.equ R32_CAN2_TXMIR2 0x400069A0 CAN2 Tx mailbox2 identifier register X 
.equ R32_CAN2_TXMDTR2 0x400069A4 CAN2 Tx mailbox2 data length and timestamp 
register X 
.equ R32_CAN2_TXMDLR2 0x400069A8 CAN2 Tx mailbox2 data low register X 
.equ R32_CAN2_TXMDHR2 0x400069AC CAN2 Tx mailbox2 data high register X 
.equ R32_CAN2_RXMIR0 0x400069B0 CAN2 Rx FIFO0 mailbox identifier register X 
.equ R32_CAN2_RXMDTR0 0x400069B4 CAN2 Rx FIFO0 mailbox data length and 
timestamp register X 
.equ R32_CAN2_RXMDLR0 0x400069B8 CAN2 Rx FIFO0 mailbox data low register X 
.equ R32_CAN2_RXMDHR0 0x400069BC CAN2 Rx FIFO0 mailbox data high register X 
.equ R32_CAN2_RXMIR1 0x400069C0 CAN2 Rx FIFO1 mailbox identifier register X 
.equ R32_CAN2_RXMDTR1 0x400069C4 CAN2 Rx FIFO1 mailbox data length and 
timestamp register X 
.equ R32_CAN2_RXMDLR1 0x400069C8 CAN2 Rx FIFO1 mailbox data low register X 
.equ R32_CAN2_RXMDHR1 0x400069CC CAN2 Rx FIFO1 mailbox data high register X 
 
