sahasradal/ch32v203_/ch32v203.inc
.equ R32_CAN1_FCTLR, 0x40006600  
.equ R32_CAN1_FMCFGR, 0x40006604  
.equ R32_CAN1_FSCFGR, 0x4000660C  
.equ R32_CAN1_FAFIFOR, 0x40006614 
.equ R32_CAN1_FWR, 0x4000661C  
.equ R32_CAN1_F0R1, 0x40006640  
.equ R32_CAN1_F0R2, 0x40006644  
.equ R32_CAN1_F1R1, 0x40006648  
.equ R32_CAN1_F1R2, 0x4000664C  
.equ R32_CAN1_F2R1, 0x40006650  
.equ R32_CAN1_F2R2, 0x40006654  
.equ R32_CAN1_F3R1, 0x40006658  
.equ R32_CAN1_F3R2, 0x4000665C  
.equ R32_CAN1_F4R1, 0x40006660  
     
.equ R32_CAN1_F4R2, 0x40006664  
.equ R32_CAN1_F5R1, 0x40006668  
.equ R32_CAN1_F5R2, 0x4000666C  
.equ R32_CAN1_F6R1, 0x40006670  
.equ R32_CAN1_F6R2, 0x40006674  
.equ R32_CAN1_F7R1, 0x40006678 
.equ R32_CAN1_F7R2, 0x4000667C  
.equ R32_CAN1_F8R1, 0x40006680  
.equ R32_CAN1_F8R2, 0x40006684  
.equ R32_CAN1_F9R1, 0x40006688  
.equ R32_CAN1_F9R2, 0x4000668C  
.equ R32_CAN1_F10R1, 0x40006690  
.equ R32_CAN1_F10R2, 0x40006694 
.equ R32_CAN1_F11R1, 0x40006698  
.equ R32_CAN1_F11R2, 0x4000669C  
.equ R32_CAN1_F12R1, 0x400066A0  
.equ R32_CAN1_F12R2, 0x400066A4  
.equ R32_CAN1_F13R1, 0x400066A8  
.equ R32_CAN1_F13R2, 0x400066AC  
.equ R32_CAN1_F14R1, 0x400066B0  
.equ R32_CAN1_F14R2, 0x400066B4  
.equ R32_CAN1_F15R1, 0x400066B8  
.equ R32_CAN1_F15R2, 0x400066BC  
.equ R32_CAN1_F16R1, 0x400066C0  
.equ R32_CAN1_F16R2, 0x400066C4  
.equ R32_CAN1_F17R1, 0x400066C8  
.equ R32_CAN1_F17R2, 0x400066CC  
.equ R32_CAN1_F18R1, 0x400066D0  
.equ R32_CAN1_F18R2, 0x400066D4  
.equ R32_CAN1_F19R1, 0x400066D8  
.equ R32_CAN1_F19R2, 0x400066DC  
.equ R32_CAN1_F20R1, 0x400066E0  
.equ R32_CAN1_F20R2, 0x400066E4  
.equ R32_CAN1_F21R1, 0x400066E8  
.equ R32_CAN1_F21R2, 0x400066EC  
.equ R32_CAN1_F22R1, 0x400066F0  
.equ R32_CAN1_F22R2, 0x400066F4  
.equ R32_CAN1_F23R1, 0x400066F8  
.equ R32_CAN1_F23R2, 0x400066FC  
.equ R32_CAN1_F24R1, 0x40006700  
.equ R32_CAN1_F24R2, 0x40006704  
.equ R32_CAN1_F25R1, 0x40006708  
.equ R32_CAN1_F25R2, 0x4000670C  
.equ R32_CAN1_F26R1, 0x40006710  
.equ R32_CAN1_F26R2, 0x40006714  
     
.equ R32_CAN1_F27R1, 0x40006718  
.equ R32_CAN1_F27R2, 0x4000671C  
 
.equ R32_CAN2_FCTLR, 0x40006A00  
.equ R32_CAN2_FMCFGR, 0x40006A04  
.equ R32_CAN2_FSCFGR, 0x40006A0C  
.equ R32_CAN2_FAFIFOR, 0x40006A14  
.equ R32_CAN2_FWR ,0x40006A1C  
.equ R32_CAN2_F0R1, 0x40006A40 
.equ R32_CAN2_F0R2, 0x40006A44 
.equ R32_CAN2_F1R1, 0x40006A48 
.equ R32_CAN2_F1R2, 0x40006A4C 
.equ R32_CAN2_F2R1, 0x40006A50 
.equ R32_CAN2_F2R2, 0x40006A54 
.equ R32_CAN2_F3R1, 0x40006A58 
.equ R32_CAN2_F3R2, 0x40006A5C 
.equ R32_CAN2_F4R1, 0x40006A60 
.equ R32_CAN2_F4R2, 0x40006A64 
.equ R32_CAN2_F5R1, 0x40006A68 
.equ R32_CAN2_F5R2, 0x40006A6C 
.equ R32_CAN2_F6R1, 0x40006A70 
.equ R32_CAN2_F6R2, 0x40006A74 
.equ R32_CAN2_F7R1, 0x40006A78 
.equ R32_CAN2_F7R2, 0x40006A7C 
.equ R32_CAN2_F8R1, 0x40006A80 
.equ R32_CAN2_F8R2, 0x40006A84 
.equ R32_CAN2_F9R1, 0x40006A88 
.equ R32_CAN2_F9R2, 0x40006A8C 
.equ R32_CAN2_F10R1, 0x40006A90  
.equ R32_CAN2_F10R2, 0x40006A94  
.equ R32_CAN2_F11R1, 0x40006A98  
.equ R32_CAN2_F11R2, 0x40006A9C  
.equ R32_CAN2_F12R1, 0x40006AA0  
.equ R32_CAN2_F12R2, 0x40006AA4  
.equ R32_CAN2_F13R1, 0x40006AA8  
.equ R32_CAN2_F13R2, 0x40006AAC  
.equ R32_CAN2_F14R1, 0x40006AB0  
.equ R32_CAN2_F14R2, 0x40006AB4  
.equ R32_CAN2_F15R1, 0x40006AB8  
.equ R32_CAN2_F15R2, 0x40006ABC  
.equ R32_CAN2_F16R1, 0x40006AC0  
.equ R32_CAN2_F16R2, 0x40006AC4  
.equ R32_CAN2_F17R1, 0x40006AC8  
     
.equ R32_CAN2_F17R2, 0x40006ACC  
.equ R32_CAN2_F18R1, 0x40006AD0  
.equ R32_CAN2_F18R2, 0x40006AD4  
.equ R32_CAN2_F19R1, 0x40006AD8  
.equ R32_CAN2_F19R2, 0x40006ADC  
.equ R32_CAN2_F20R1, 0x40006AE0  
.equ R32_CAN2_F20R2, 0x40006AE4  
.equ R32_CAN2_F21R1, 0x40006AE8  
.equ R32_CAN2_F21R2, 0x40006AEC  
.equ R32_CAN2_F22R1, 0x40006AF0  
.equ R32_CAN2_F22R2, 0x40006AF4  
.equ R32_CAN2_F23R1, 0x40006AF8  
.equ R32_CAN2_F23R2, 0x40006AFC  
.equ R32_CAN2_F24R1, 0x40006B00  
.equ R32_CAN2_F24R2, 0x40006B04  
.equ R32_CAN2_F25R1, 0x40006B08  
.equ R32_CAN2_F25R2, 0x40006B0C  
.equ R32_CAN2_F26R1, 0x40006B10  
.equ R32_CAN2_F26R2, 0x40006B14  
.equ R32_CAN2_F27R1, 0x40006B18  
.equ R32_CAN2_F27R2, 0x40006B1C 




.equ R8_DVP_CR0 ,0x50050000 
.equ R8_DVP_CR1,0x50050001 
.equ R8_DVP_IER,0x50050002 
.equ R16_DVP_ROW_NUM ,0x50050004 
.equ R16_DVP_COL_NUM ,0x50050006 
.equ R32_DVP_DMA_BUF0, 0x50050008  
.equ R32_DVP_DMA_BUF1, 0x5005000C  
.equ R8_DVP_IFR, 0x50050010  
.equ R8_DVP_STATUS, 0x50050011 
.equ R16_DVP_ROW_CNT, 0x50050014 
.equ R16_DVP_HOFFCNT, 0x50050018 
.equ R16_DVP_VST, 0x5005001A  
.equ R16_DVP_CAPCNT, 0x5005001C  
.equ R16_DVP_VLINE, 0x5005001E  
.equ R32_DVP_DR, 0x50050020 


.equ R32_FSMC_BCR1, 0xA0000000 
.equ R32_FSMC_BTR1, 0xA0000004 
.equ R32_FSMC_PCR2, 0xA0000060  
.equ R32_FSMC_SR2, 0xA0000064  
.equ R32_FSMC_PMEM2, 0xA0000068 
.equ R32_FSMC_PATT2, 0xA000006C 
.equ R32_FSMC_ECCR2, 0xA0000074 
.equ R32_FSMC_BWTR1, 0xA0000104 


.equ R32_ETH_MACCR ,0x40028000 
.equ R32_ETH_MACFFR,0x40028004 
.equ R32_ETH_MACHTHR ,0x40028008 
.equ R32_ETH_MACHTLR ,0x4002800C 
.equ R32_ETH_MACMIIAR,0x40028010 
.equ R32_ETH_MACMIIDR,0x40028014 
.equ R32_ETH_MACFCR,0x40028018 
.equ R32_ETH_MACVLAN ,0x4002801C 
.equ R32_ETH_MACRWUFFR, 0x40028028 
.equ R32_ETH_MACPMTCSR, 0x4002802C 
  
.equ R32_ETH_MACSR, 0x40028038  
.equ R32_ETH_MACIMR, 0x4002803C  
.equ R32_ETH_MACA0HR, 0x40028040  
.equ R32_ETH_MACA0LR, 0x40028044  
.equ R32_ETH_MACA1HR, 0x40028048  
.equ R32_ETH_MACA1LR, 0x4002804C  
.equ R32_ETH_MACA2HR, 0x40028050  
.equ R32_ETH_MACA2LR, 0x40028054  
.equ R32_ETH_MACA3HR, 0x40028058  
.equ R32_ETH_MACA3LR, 0x4002805C  
 

.equ R32_ETH_MMCCR, 0x40028100  
.equ R32_ETH_MMCRIR, 0x40028104 
.equ R32_ETH_MMCTIR, 0x40028108 
.equ R32_ETH_MMCRIMR, 0x4002810C
.equ R32_ETH_MMCTIMR, 0x40028110 
.equ R32_ETH_MMCTGFSCCR, 0x4002814C 
.equ R32_ETH_MMCTGFMSCCR, 0x40028150 
.equ R32_ETH_MMCTGFCR, 0x40028168 
.equ R32_ETH_MMCRFCECR, 0x40028194 
.equ R32_ETH_MMCRFAECR, 0x40028198 
.equ R32_ETH_MMCRGUFCR, 0x400281C4 
 
 
