sahasradal/ch32v203_/ch32v203.inc
.equ R32_ETH_PTPTSCR, 0x40028700  
.equ R32_ETH_PTPSSIR, 0x40028704  
.equ R32_ETH_PTPTSHR, 0x40028708  
.equ R32_ETH_PTPTSLR, 0x4002870C  
.equ R32_ETH_PTPTSHUR, 0x40028710
.equ R32_ETH_PTPTSLUR, 0x40028714 
.equ R32_ETH_PTPTSAR, 0x40028718  
.equ R32_ETH_PTPTTHR, 0x4002871C  
.equ R32_ETH_PTPTTLR, 0x40028720  
.equ R32_ETH_DMABMR, 0x40029000 
.equ R32_ETH_DMATPDR, 0x40029004  
.equ R32_ETH_DMARPTR, 0x40029008  
.equ R32_ETH_DMARDLAR, 0x4002900C 
.equ R32_ETH_DMATDLAR, 0x40029010 
.equ R32_ETH_DMASR, 0x40029014  
.equ R32_ETH_DMAOMR, 0x40029018 
.equ R32_ETH_DMAIER, 0x4002901C 
.equ R32_ETH_DMAMFBOCR, 0x40029020  
.equ R32_ETH_DMACHTDR, 0x40029048  
.equ R32_ETH_DMACHRDR, 0x4002904C  
.equ R32_ETH_DMACHTBAR, 0x40029050  
.equ R32_ETH_DMACHRBAR, 0x40029054 




.equ R8_ETH_EIE, 0x40028003 
.equ R8_ETH_EIR, 0x40028004 
.equ R8_ETH_ESTAT, 0x40028005  
.equ R8_ETH_ECON2, 0x40028006 
.equ R8_ETH_ECON1 ,0x40028007  
.equ R32_ETH_TX ,0x40028008  
.equ R16_ETH_ETXST 0x40028008 
.equ R16_ETH_ETXLN, 0x4002800A  
.equ R32_ETH_RX, 0x4002800C  
.equ R16_ETH_ERXST, 0x4002800C 
.equ R16_ETH_ERXLN ,0x4002800E  
.equ R32_ETH_HTL ,0x40028010  
.equ R32_ETH_HTH ,0x40028014  
.equ R32_ETH_MACON ,0x40028018 
.equ R8_ETH_ERXFCON ,0x40028018 
.equ R8_ETH_MACON1, 0x40028019  
.equ R8_ETH_MACON2, 0x4002801A  
.equ R8_ETH_MABBIPG, 0x4002801B  
.equ R32_ETH_TIM ,0x4002801C 
.equ R16_ETH_EPAUS ,0x4002801C 
.equ R16_ETH_MAMXFL, 0x4002801E 
.equ R16_ETH_MIRD, 0x40028020 
.equ R32_ETH_MIWR, 0x40028024  
.equ R8_ETH_MIREGADR, 0x40028024  
.equ R8_ETH_MISTAT, 0x40028025  
.equ R16_ETH_MIWR, 0x40028026  
.equ R32_ETH_MAADRL, 0x40028028 
     
.equ R16_ETH_MAADRH, 0x4002802C  




.equ R32_SDIO_POWER ,0x40018000 
 
.equ R32_SDIO_CLKCR ,0x40018004 

.equ R32_SDIO_ARG ,0x40018008 
.equ R32_SDIO_CMD, 0x4001800C  
.equ R32_SDIO_RESPCMD, 0x40018010 
.equ R128_SDIO_RESPX, 0x40018014  
.equ R32_SDIO_DTIMER, 0x40018024  
.equ R32_SDIO_DLEN, 0x40018028  
.equ R32_SDIO_DCTLR, 0x4001802C  
.equ R32_SDIO_DCOUNT, 0x40018030  
.equ R32_SDIO_STA, 0x40018034  
.equ R32_SDIO_ICR, 0x40018038 
.equ R32_SDIO_MASK, 0x4001803C  
.equ R32_SDIO_ FIFOCNT, 0x40018048 
.equ R32_SDIO_FIFO, 0x40018080  

.equ R32_RNG_CR, 0x40023C00 
.equ R32_RNG_SR ,0x40023C04  
.equ R32_RNG_DR ,0x40023C08  
.equ R32_OPA_CTLR, 0x40023804
.equ R16_ESIG_FLACAP, 0x1FFFF7E0  
.equ R32_ESIG_UNIID1, 0x1FFFF7E8 
.equ R32_ESIG_UNIID2, 0x1FFFF7EC  
.equ R32_ESIG_UNIID3, 0x1FFFF7F0  
.equ R32_FLASH_KEYR ,0x40022004 
.equ R32_FLASH_OBKEYR ,0x40022008 
.equ R32_FLASH_STATR 0x4002200C  
.equ R32_FLASH_CTLR 0x40022010 
.equ R32_FLASH_ADDR 0x40022014  
.equ R32_FLASH_OBR 0x4002201C  
.equ R32_FLASH_WPR 0x40022020  
.equ R32_FLASH_MODEKEYR 0x40022024 
.equ R32_EXTEN_CTR ,0x40023800 





 
